EDT/УТ/src/Documents/зпРасчетЗП/зпРасчетЗП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>зпРасчетЗП</name>
  <registerRecords>AccumulationRegister.зпРасчетЗП</registerRecords>
  <attributes>
    <name>ПериодРасчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>ДатаРасчета</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>РольСотрудника</name>
      <type>
        <types>CatalogRef.РолиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>Тариф</name>
      <type>
        <types>CatalogRef.зпНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗанятости</name>
      <type>
        <types>EnumRef.зпВидыЗанятости</types>
      </type>
    </attributes>
    <attributes>
      <name>Рейс</name>
      <type>
        <types>DocumentRef.Рейс</types>
      </type>
    </attributes>
    <attributes>
      <name>СоставЭкипажа</name>
      <type>
        <types>EnumRef.зпСоставЭкипажа</types>
      </type>
    </attributes>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>CatalogRef.зпНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентВыполненияЗаказов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасовОтработано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Километраж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщееКоличествоЗаказов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаказовВыполненныхПоАлгоритмуРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СхемаРасчетаЗП</name>
      <type>
        <types>CatalogRef.зпСхемыРасчетаЗП</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифРасчетаЗП</name>
      <type>
        <types>CatalogRef.зпТарифыРасчетаЗП</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособРасчетаПроцентаВыполняемости</name>
      <type>
        <types>CatalogRef.СпособыРасчетаПроцентаВыполняемости</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументНачисления</name>
      <type>
        <types>DocumentRef.зпФиксацияДополнительныхНачисленийУдержаний</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Удержания</name>
    <attributes>
      <name>ДатаРасчета</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>РольСотрудника</name>
      <type>
        <types>CatalogRef.РолиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>Тариф</name>
      <type>
        <types>CatalogRef.зпНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗанятости</name>
      <type>
        <types>EnumRef.зпВидыЗанятости</types>
      </type>
    </attributes>
    <attributes>
      <name>Рейс</name>
      <type>
        <types>DocumentRef.Рейс</types>
      </type>
    </attributes>
    <attributes>
      <name>СоставЭкипажа</name>
      <type>
        <types>EnumRef.зпСоставЭкипажа</types>
      </type>
    </attributes>
    <attributes>
      <name>Удержание</name>
      <type>
        <types>CatalogRef.зпУдержания</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СхемаРасчетаЗП</name>
      <type>
        <types>CatalogRef.зпСхемыРасчетаЗП</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифРасчетаЗП</name>
      <type>
        <types>CatalogRef.зпТарифыРасчетаЗП</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументУдержания</name>
      <type>
        <types>DocumentRef.зпФиксацияДополнительныхНачисленийУдержаний</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрименяемыеМинимальныеСтавки</name>
    <attributes>
      <name>ДатаРасчета</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНачисленнойЗП</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаМинимальнойСтавки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоплатаДоМинимальнойСтавки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/AccumulationRegisters/зпРасчетЗП/зпРасчетЗП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>зпРасчетЗП</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ОбщееКоличествоЗаказов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗаказовВыполненныхПоАлгоритмуРасчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентВыполненияЗаказов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаПроцентаВыполняемости</name>
    <type>
      <types>CatalogRef.СпособыРасчетаПроцентаВыполняемости</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаРасчетаЗП</name>
    <type>
      <types>CatalogRef.зпСхемыРасчетаЗП</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарифРасчетаЗП</name>
    <type>
      <types>CatalogRef.зпТарифыРасчетаЗП</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧасовОтработано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Километраж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРасчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РольСотрудника</name>
    <type>
      <types>CatalogRef.РолиСотрудников</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тариф</name>
    <type>
      <types>CatalogRef.зпНачисления</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗанятости</name>
    <type>
      <types>EnumRef.зпВидыЗанятости</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СоставЭкипажа</name>
    <type>
      <types>EnumRef.зпСоставЭкипажа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НачислениеУдержание</name>
    <type>
      <types>CatalogRef.зпУдержания</types>
      <types>CatalogRef.зпНачисления</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРасчета</name>
    <type>
      <types>EnumRef.зпВидыРасчетаЗП</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/InformationRegisters/зпЗакрытыеРасчетныеПериоды/зпЗакрытыеРасчетныеПериоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>зпЗакрытыеРасчетныеПериоды</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ПериодЗакрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef.зпРасчетЗП</types>
    </type>
  </attributes>
  <dimensions>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/зпВидыРасчетаЗП/зпВидыРасчетаЗП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>зпВидыРасчетаЗП</name>
  <enumValues>
    <name>Начисление</name>
  </enumValues>
  <enumValues>
    <name>Удержание</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/зпРасчетЗП/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.зпРасчетЗП.Записывать = Истина;
	Движения.зпРасчетЗП.Очистить();
	
	ВидРасчета = Перечисления.зпВидыРасчетаЗП.Начисление;
	
	Для Каждого СтрокаРасчета Из Начисления Цикл
		
		Движение = Движения.зпРасчетЗП.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, СтрокаРасчета);
		Движение.Период = Дата;
		Движение.Регион = Регион;
		Движение.НачислениеУдержание = СтрокаРасчета.Начисление;
		Движение.ВидРасчета = ВидРасчета;
		
	КонецЦикла;
	
	ВидРасчета = Перечисления.зпВидыРасчетаЗП.Удержание;
	
	Для Каждого СтрокаРасчета Из Удержания Цикл
		
		Движение = Движения.зпРасчетЗП.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, СтрокаРасчета);
		Движение.Период = Дата;
		Движение.Регион = Регион;
		Движение.НачислениеУдержание = СтрокаРасчета.Удержание;
		Движение.ВидРасчета = ВидРасчета;
		Движение.Сумма = -СтрокаРасчета.Сумма;
		
	КонецЦикла;
	
	Движение = РегистрыСведений.зпЗакрытыеРасчетныеПериоды.СоздатьМенеджерЗаписи();
	Движение.Период = ТекущаяДата();
	Движение.Регион = Регион;
	Движение.РасчетныйПериод = ПериодРасчета;
	Движение.ПериодЗакрыт = Истина;
	Движение.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Движение.Документ = Ссылка;
	Движение.Записать();
	
КонецПроцедуры
